import { generatePlacesDesc } from "../../components/places/places";

export function generateCountryPage(id: number) {

// функция для генерации кнопки с модальным окном, для отображения интересных мест страны.
// Принимает путь до img, places.name и places.description
// Пока стоят заглушки
   return generatePlacesDesc('../../assets/images/places/australia/sydney_opera_house.jpg', 'Сиднейский оперный театр', `Сиднейский оперный театр, считающийся архитектурным шедевром 20-го века, был спроектирован и построен архитектором Йорном Утзоном, чтобы отразить образ огромного парусного корабля. В нем есть несколько площадок, на которых ежегодно проводится более 1500 представлений. Знаменитый Оперный театр в Сиднее, окруженный красивыми пейзажами Сиднейской гавани и Королевского ботанического сада, является одной из самых известных достопримечательностей Австралии.`);
}
